#pragma once

#include "XWAFramework.h"
#include "Matrices.h"
#include "../shaders/material_defs.h"
#include "../shaders/shader_common.h"
#include <vector>

constexpr auto MAX_CACHED_MATERIALS = 32;
constexpr auto MAX_TEXNAME = 40;
constexpr auto MAX_OPT_NAME = 80;
constexpr auto MAX_TEX_SEQ_NAME = 80;
constexpr auto MAX_CANNONS = 8;
constexpr auto MAX_GREEBLE_NAME = 80;
constexpr auto MAX_GREEBLE_LEVELS = 2;
constexpr auto MAX_NORMALMAP_NAME = 80;

typedef enum GreebleBlendModeEnum {
	GBM_MULTIPLY = 1,
	GBM_OVERLAY,
	GBM_SCREEN,
	GBM_REPLACE,
	GBM_NORMAL_MAP,
	GBM_UV_DISP,
	GBM_UV_DISP_AND_NORMAL_MAP,
	// Add more blending modes here, if you do, also update Materials.cpp:g_sGreebleBlendModes
	GBM_MAX_MODES, // Sentinel, do not remove!
} GreebleBlendMode;

extern char *g_sGreebleBlendModes[GBM_MAX_MODES - 1];

typedef enum DiegeticMeshEnum {
	DM_NONE,

	DM_JOYSTICK,

	DM_THR_ROT_X,
	DM_THR_ROT_Y,
	DM_THR_ROT_Z,
	DM_THR_TRANS,
	DM_THR_ROT_ANY,

	DM_HYPER_ROT_X,
	DM_HYPER_ROT_Y,
	DM_HYPER_ROT_Z,
	DM_HYPER_TRANS,
	DM_HYPER_ROT_ANY,
} DiegeticMeshType;

/*

How to add support for a new global event:

1. Add the new event in GameEventEnum
2. Add the corresponding string for the new event in g_sGameEventNames, follow the naming rules!
3. Add a new field to g_GameEvent (if applicable).
4. Add support in BeginScene (or wherever relevant) to detect the new event. Add it to g_GameEvent.<Relevant-Field>
5. Update Materials.h:GetCurrentATCIndex(). Mind the priority of the new event!

2. Add the corresponding string for the new event in Materials.cpp:g_sInstEventNames, follow the naming rules!
3. Add a new field to InstanceEvent (if applicable).
4. Add support in EffectsRenderer::MainSceneHook() (or wherever relevant) to detect the new event.
5. Update Materials.h:GetCurrentInstATCIndex(). Mind the priority of the new event!
6. Update Materials.cpp:ResetGameEvent()
7. Update Materials.cpp:UpdateEventsFired()

*/

constexpr int TEXTURE_ATC_IDX = 0;
constexpr int LIGHTMAP_ATC_IDX = 1;
constexpr int MAX_ATC_TYPES = 2;
constexpr int MAX_ALT_EXPLOSIONS = 5;
/* Alternate explosions will be loaded in slots 0..3. The following slot is for DS2 explosions */
constexpr int DS2_ALT_EXPLOSION_IDX = 4;

// Target Event Enum
// This enum can be used to trigger animations or changes in materials
// when target-relate events occur.
// For now, the plan is to use it to change which animated textures are
// displayed.
typedef enum GameEventEnum {
	EVT_NONE = 0,				// Play when no other event is active
	TGT_EVT_SELECTED,			// Something has been targeted
	TGT_EVT_LASER_LOCK,			// Laser is "locked"
	TGT_EVT_WARHEAD_LOCKING,		// Warhead is locking (yellow)
	TGT_EVT_WARHEAD_LOCKED,		// Warhead is locked (red)
	// Cockpit Instrument Damage Events
	CPT_EVT_BROKEN_CMD,
	CPT_EVT_BROKEN_LASER_ION,
	CPT_EVT_BROKEN_BEAM_WEAPON,
	CPT_EVT_BROKEN_SHIELDS,
	CPT_EVT_BROKEN_THROTTLE,
	CPT_EVT_BROKEN_SENSORS,
	CPT_EVT_BROKEN_LASER_RECHARGE,
	CPT_EVT_BROKEN_ENGINE_POWER,
	CPT_EVT_BROKEN_SHIELD_RECHARGE,
	CPT_EVT_BROKEN_BEAM_RECHARGE,
	// Hull Damage Events
	HULL_EVT_DAMAGE_75,
	HULL_EVT_DAMAGE_50,
	HULL_EVT_DAMAGE_25,
	// Warning Light Events
	WLIGHT_EVT_LEFT,
	WLIGHT_EVT_MID_LEFT,
	WLIGHT_EVT_MID_RIGHT,
	WLIGHT_EVT_RIGHT_YELLOW,
	WLIGHT_EVT_RIGHT_RED,
	// Laser/Ion cannon ready events
	CANNON_EVT_1_READY,
	CANNON_EVT_2_READY,
	CANNON_EVT_3_READY,
	CANNON_EVT_4_READY,
	CANNON_EVT_5_READY,
	CANNON_EVT_6_READY,
	CANNON_EVT_7_READY,
	CANNON_EVT_8_READY,
	// How many more cannons can be supported?
	// ... Add more events here
	// End-of-events sentinel. Do not remove!
	MAX_GAME_EVT
} GameEvent;

extern char *g_sGameEventNames[MAX_GAME_EVT];

typedef enum {
	IEVT_NONE = 0,
	// Hull Damage Events
	IEVT_HULL_DAMAGE_75,
	IEVT_HULL_DAMAGE_50,
	IEVT_HULL_DAMAGE_25,

	IEVT_SHIELDS_DOWN,
	
	IEVT_TRACTOR_BEAM,
	IEVT_JAMMING_BEAM,

	// Add new events here...

	// End-of-events sentinel. Do not remove!
	MAX_INST_EVT
} InstEventType;

extern char *g_sInstEventNames[MAX_INST_EVT];

// *********************
// Cockpit Damage
// *********************
/*
 0x0001 is the CMD/Targeting computer.
 0x000E is the laser/ion display. Looks like all 3 bits must be on, but not sure what happens if the craft doesn't have ions
 0x0010 is the beam weapon
 0x0020 is the shields display
 0x0040 is the throttle (text) display <-- This matches the code that Jeremy provided (see m181 & 64 below)
 0x0180 both sensors. Both bits must be on, if either bit is off, both sensors will shut down
 0x0200 lasers recharge rate
 0x0400 engine level
 0x0800 shields recharge rate
 0x1000 beam recharge rate
*/
typedef union CockpitDamageUnion {
	struct {
		/* 0x0001 */ WORD CMD : 1;
		/* 0x000E */ WORD LaserIon : 3;
		/* 0x0010 */ WORD BeamWeapon : 1;
		/* 0x0020 */ WORD Shields : 1;
		/* 0x0040 */ WORD Throttle : 1;
		/* 0x0180 */ WORD Sensors : 2;
		/* 0x0200 */ WORD LaserRecharge : 1;
		/* 0x0400 */ WORD EngineLevel : 1;
		/* 0x0800 */ WORD ShieldRecharge : 1;
		/* 0x1000 */ WORD BeamRecharge : 1;
	};
	WORD Flags;
} CockpitDamage;

typedef struct CockpitInstrumentStateStruct {
	bool CMD;
	bool LaserIon;
	bool BeamWeapon;
	bool Shields;
	bool Throttle;
	bool Sensors;
	bool LaserRecharge;
	bool EnginePower;
	bool ShieldRecharge;
	bool BeamRecharge;

	CockpitInstrumentStateStruct() {
		CMD = true;
		LaserIon = true;
		BeamWeapon = true;
		Shields = true;
		Throttle = true;
		Sensors = true;
		LaserRecharge = true;
		EnginePower = true;
		ShieldRecharge = true;
		BeamRecharge = true;
	}

	void FromXWADamage(WORD XWADamage);
} CockpitInstrumentState;

typedef struct GlobalGameEventStruct {
	GameEvent TargetEvent;
	CockpitInstrumentState CockpitInstruments, InitialCockpitInstruments;
	bool bCockpitInitialized;
	GameEvent HullEvent;
	// Warning Lights Events
	bool WLightLLEvent;
	bool WLightMLEvent;
	bool WLightMREvent;
	uint8_t WLightRREvent;
	// Cannon Ready Events
	bool CannonReady[MAX_CANNONS];

	GlobalGameEventStruct() {
